// 9. Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.
// 78 -> 8 
// 12-> 2 
// 85 -> 8

int val = new Random().Next(10, 99);
int diw = val / 10;
int mod = val % 10;

Console.WriteLine(val);

if (diw>diw) 
{
    Console.WriteLine(diw);
}
else 
{
    Console.WriteLine(diw);
}